--
-- Скрипт сгенерирован Devart dbForge Studio for MySQL, Версия 6.3.358.0
-- Домашняя страница продукта: http://www.devart.com/ru/dbforge/mysql/studio
-- Дата скрипта: 19.02.2016 21:14:16
-- Версия сервера: 5.6.20-log
-- Версия клиента: 4.1
--


--
-- Описание для базы данных smileexpo
--
DROP DATABASE IF EXISTS smileexpo;
CREATE DATABASE IF NOT EXISTS smileexpo
	CHARACTER SET utf8
	COLLATE utf8_general_ci;

-- 
-- Отключение внешних ключей
-- 
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;

-- 
-- Установить режим SQL (SQL mode)
-- 
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;

-- 
-- Установка кодировки, с использованием которой клиент будет посылать запросы на сервер
--
SET NAMES 'utf8';

-- 
-- Установка базы данных по умолчанию
--
USE smileexpo;

--
-- Описание для таблицы nestedsets
--
CREATE TABLE IF NOT EXISTS nestedsets (
  id INT(11) NOT NULL,
  name VARCHAR(50) NOT NULL,
  lft INT(11) NOT NULL,
  rgt INT(11) NOT NULL,
  lvl INT(11) NOT NULL,
  PRIMARY KEY (id)
)
ENGINE = INNODB
AVG_ROW_LENGTH = 163
CHARACTER SET utf8
COLLATE utf8_general_ci;

-- 
-- Вывод данных для таблицы nestedsets
--
INSERT INTO nestedsets VALUES
(1, '1', 1, 200, 1),
(2, '2', 2, 119, 2),
(3, '3', 120, 183, 2),
(4, '4', 184, 185, 2),
(5, '5', 186, 195, 2),
(6, '6', 196, 199, 2),
(7, '7', 3, 22, 3),
(8, '8', 23, 52, 3),
(9, '9', 53, 82, 3),
(10, '10', 83, 88, 3),
(11, '11', 89, 102, 3),
(12, '12', 103, 118, 3),
(13, '13', 121, 126, 3),
(14, '14', 127, 170, 3),
(15, '15', 171, 180, 3),
(16, '16', 181, 182, 3),
(17, '17', 187, 190, 3),
(18, '18', 191, 194, 3),
(19, '19', 197, 198, 3),
(20, '20', 4, 19, 4),
(21, '21', 20, 21, 4),
(22, '22', 24, 45, 4),
(23, '23', 46, 49, 4),
(24, '24', 50, 51, 4),
(25, '25', 54, 69, 4),
(26, '26', 70, 77, 4),
(27, '27', 78, 79, 4),
(28, '28', 80, 81, 4),
(29, '29', 84, 87, 4),
(30, '30', 90, 93, 4),
(31, '31', 94, 97, 4),
(32, '32', 98, 101, 4),
(33, '33', 104, 115, 4),
(34, '34', 116, 117, 4),
(35, '35', 122, 125, 4),
(36, '36', 128, 165, 4),
(37, '37', 166, 167, 4),
(38, '38', 168, 169, 4),
(39, '39', 172, 179, 4),
(40, '40', 188, 189, 4),
(41, '41', 192, 193, 4),
(42, '42', 5, 10, 5),
(43, '43', 11, 18, 5),
(44, '44', 25, 36, 5),
(45, '45', 37, 38, 5),
(46, '46', 39, 42, 5),
(47, '47', 43, 44, 5),
(48, '48', 47, 48, 5),
(49, '49', 55, 64, 5),
(50, '50', 65, 68, 5),
(51, '51', 71, 76, 5),
(52, '52', 85, 86, 5),
(53, '53', 91, 92, 5),
(54, '54', 95, 96, 5),
(55, '55', 99, 100, 5),
(56, '56', 105, 114, 5),
(57, '57', 123, 124, 5),
(58, '58', 129, 152, 5),
(59, '59', 153, 162, 5),
(60, '60', 163, 164, 5),
(61, '61', 173, 176, 5),
(62, '62', 177, 178, 5),
(63, '63', 6, 7, 6),
(64, '64', 8, 9, 6),
(65, '65', 12, 17, 6),
(66, '66', 26, 35, 6),
(67, '67', 40, 41, 6),
(68, '68', 56, 61, 6),
(69, '69', 62, 63, 6),
(70, '70', 66, 67, 6),
(71, '71', 72, 75, 6),
(72, '72', 106, 113, 6),
(73, '73', 130, 147, 6),
(74, '74', 148, 151, 6),
(75, '75', 154, 159, 6),
(76, '76', 160, 161, 6),
(77, '77', 174, 175, 6),
(78, '78', 13, 14, 7),
(79, '79', 15, 16, 7),
(80, '80', 27, 30, 7),
(81, '81', 31, 32, 7),
(82, '82', 33, 34, 7),
(83, '83', 57, 60, 7),
(84, '84', 73, 74, 7),
(85, '85', 107, 110, 7),
(86, '86', 111, 112, 7),
(87, '87', 131, 138, 7),
(88, '88', 139, 144, 7),
(89, '89', 145, 146, 7),
(90, '90', 149, 150, 7),
(91, '91', 155, 158, 7),
(92, '92', 28, 29, 8),
(93, '93', 58, 59, 8),
(94, '94', 108, 109, 8),
(95, '95', 132, 137, 8),
(96, '96', 140, 143, 8),
(97, '97', 156, 157, 8),
(98, '98', 133, 136, 9),
(99, '99', 141, 142, 9),
(100, '100', 134, 135, 10);

-- 
-- Восстановить предыдущий режим SQL (SQL mode)
-- 
/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;

-- 
-- Включение внешних ключей
-- 
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;